tap "homebrew/autoupdate"
tap "jakewharton/repo"
tap "omico/tap"
brew "shellcheck"
brew "actionlint"
brew "bazelisk"
brew "chezmoi"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "create-dmg"
brew "curl"
brew "docker", link: false
brew "fastfetch"
brew "fish"
brew "fnm"
brew "gh"
brew "git"
brew "git-lfs"
brew "openjdk"
brew "gradle"
brew "icu4c@77"
brew "gradle-profiler"
brew "graphviz"
brew "helm"
brew "jadx"
brew "jenkins-lts", restart_service: :changed
brew "jenv"
brew "kdoctor"
brew "kotlin"
brew "ktfmt"
brew "ktlint"
brew "llvm"
brew "lsusb"
brew "mas"
brew "ncurses"
brew "opentofu"
brew "p7zip"
brew "pinentry-mac"
brew "pnpm"
brew "podman"
brew "protobuf"
brew "python@3.13"
brew "rbenv"
brew "repo"
brew "shfmt"
brew "specify"
brew "starship"
brew "telnet"
brew "thefuck"
brew "tlrc"
brew "unzip"
brew "uv"
brew "virtualenv"
brew "wgcf"
brew "wget"
brew "xcodegen"
brew "ykman"
brew "yq"
brew "zip"
cask "android-commandlinetools"
cask "antigravity"
cask "anydesk"
cask "anythingllm"
cask "autodesk-fusion"
cask "balenaetcher"
cask "beyond-compare"
cask "bricklink-studio"
cask "calibre"
cask "chatgpt-atlas"
cask "clash-verge-rev"
cask "codex"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dotnet-sdk"
cask "easydict"
cask "firefox"
cask "flutter"
cask "font-fira-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "iina"
cask "iterm2"
cask "itermbrowserplugin"
cask "jetbrains-toolbox"
cask "keka"
cask "kekaexternalhelper"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "nomachine"
cask "obs"
cask "ollama-app"
cask "parallels"
cask "podman-desktop"
cask "powershell"
cask "qbittorrent"
cask "sketchup"
cask "slack"
cask "snipaste"
cask "squirrel-app"
cask "steam"
cask "tailscale-app"
cask "telegram-desktop"
cask "tencent-meeting"
cask "unity-hub"
cask "visual-studio-code"
cask "warp"
cask "windows-app"
cask "zulu@11"
cask "zulu@17"
cask "zulu@21"
cask "zulu@8"
mas "Bitwarden", id: 1352778147
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
