tap "homebrew/autoupdate"
tap "homebrew/cask"
brew "shellcheck"
brew "actionlint"
brew "chezmoi"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "fastfetch"
brew "gh"
brew "git"
brew "icu4c@77"
brew "openjdk"
brew "gradle"
brew "helm"
brew "jadx"
brew "jenv"
brew "kdoctor"
brew "kotlin"
brew "python@3.13"
brew "llvm"
brew "lsusb"
brew "mas"
brew "nvm"
brew "opentofu"
brew "p7zip"
brew "pinentry-mac"
brew "rbenv"
brew "repo"
brew "ruby"
brew "shfmt"
brew "telnet"
brew "thefuck"
brew "tlrc"
brew "wgcf"
brew "wget"
brew "ykman"
brew "ykpers"
brew "yq"
cask "android-commandlinetools"
cask "anydesk"
cask "anythingllm"
cask "autodesk-fusion"
cask "bartender"
cask "beyond-compare"
cask "bricklink-studio"
cask "clash-verge-rev"
cask "cloudflare-warp"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dotnet-sdk"
cask "easydict"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "git-credential-manager"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "iina"
cask "jetbrains-toolbox"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "nomachine"
cask "obs"
cask "ollama-app"
cask "parallels"
cask "powershell"
cask "qbittorrent"
cask "slack"
cask "snipaste"
cask "squirrel-app"
cask "steam"
cask "tailscale-app"
cask "telegram-desktop"
cask "temurin@11"
cask "temurin@17"
cask "temurin@21"
cask "temurin@8"
cask "tencent-meeting"
cask "visual-studio-code"
cask "windows-app"
mas "Bitwarden", id: 1352778147
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
