tap "anomalyco/tap"
tap "jakewharton/repo"
tap "microsoft/apm"
tap "nguyenphutrong/tap"
tap "omico/tap"
brew "shellcheck"
brew "actionlint"
brew "aria2"
brew "bazelisk"
brew "chezmoi"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "create-dmg"
brew "curl"
brew "docker"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "openjdk"
brew "gradle"
brew "gradle-profiler"
brew "graphviz"
brew "helm"
brew "jadx"
brew "jenkins-lts", restart_service: :changed
brew "jenv"
brew "kdoctor"
brew "kotlin"
brew "ktfmt"
brew "ktlint"
brew "llvm"
brew "lsusb"
brew "mas"
brew "minikube"
brew "ncurses"
brew "opentofu"
brew "p7zip"
brew "pinentry-mac"
brew "pnpm"
brew "powershell"
brew "promptfoo"
brew "protobuf"
brew "python@3.11"
brew "python@3.13"
brew "rbenv"
brew "repo"
brew "ripgrep"
brew "shfmt"
brew "specify"
brew "starship"
brew "telnet"
brew "thefuck"
brew "tlrc"
brew "unzip"
brew "uv"
brew "virtualenv"
brew "wgcf"
brew "wget"
brew "whisper-cpp"
brew "xcodegen"
brew "ykman"
brew "yq"
brew "zip"
brew "anomalyco/tap/opencode"
brew "microsoft/apm/apm"
cask "android-commandlinetools"
cask "anydesk"
cask "anythingllm"
cask "balenaetcher"
cask "calibre"
cask "codex"
cask "dotnet-sdk"
cask "easydict"
cask "font-fira-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager"
cask "gpg-suite"
cask "iina"
cask "kekaexternalhelper"
cask "microsoft-office"
cask "powershell"
cask "qbittorrent"
cask "nguyenphutrong/tap/quotio"
cask "sketchup"
cask "snipaste"
cask "squirrel-app"
cask "tencent-meeting"
cask "windows-app"
cask "zulu@11"
cask "zulu@17"
cask "zulu@21"
cask "zulu@8"
mas "Bitwarden", id: 1352778147
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
